FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_GPDMA.c
/*-------------------------------------------------------------------------*
 * File:  GPDMA.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC1768 GP DMA controller.
 * Implementation:
 *
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <LPC1768_UtilityFuncs.h>
#include <stddef.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/NXP/LPC1768/LPC1768_GPDMA.h>

// TBD:  not here!
#include <uEZRTOS.h>

/*-------------------------------------------------------------------------*
 * Defines:
 *-------------------------------------------------------------------------*/
#define INTERRUPT_CHANNEL_GP_DMA                            DMA_IRQn

#define GPDMA_FLOW_CONTROL_DMA_CONTROLLER                   (0<<2)
#define GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER            (1<<2)
#define GPDMA_FLOW_CONTROL_SOURCE_IS_MEMORY                 (0<<1)
#define GPDMA_FLOW_CONTROL_SOURCE_IS_PERIPHERAL             (1<<1)
#define GPDMA_FLOW_CONTROL_DESTINATION_IS_MEMORY            (0<<0)
#define GPDMA_FLOW_CONTROL_DESTINATION_IS_PERIPHERAL        (1<<0)

#define GPDMA_CHANNEL0 0
#define GPDMA_CHANNEL1 1
#define GPDMA_CHANNEL2 2
#define GPDMA_CHANNEL3 3
#define GPDMA_CHANNEL4 4
#define GPDMA_CHANNEL5 5
#define GPDMA_CHANNEL6 6
#define GPDMA_CHANNEL7 7

#define DMACDMACCDMACConfiguration_FlowCntrl_BIT    11
#define DMACDMACCDMACConfiguration_OFFSET 0x110
#define DMACDMACCDMACConfiguration_E_MASK 0x1
#define DMACDMACCDMACConfiguration_E 0x1
#define DMACDMACCDMACConfiguration_E_BIT 0
#define DMACDMACCDMACConfiguration_SrcPeripheral_MASK 0x1E
#define DMACDMACCDMACConfiguration_SrcPeripheral_BIT 1
#define DMACDMACCDMACConfiguration_DestPeripheral_MASK 0x3C0
#define DMACDMACCDMACConfiguration_DestPeripheral_BIT 6
#define DMACDMACCDMACConfiguration_FlowCntrl_MASK 0x3800
#define DMACDMACCDMACConfiguration_FlowCntrl_BIT 11
#define DMACDMACCDMACConfiguration_IE_MASK 0x4000
#define DMACDMACCDMACConfiguration_IE 0x4000
#define DMACDMACCDMACConfiguration_IE_BIT 14
#define DMACDMACCDMACConfiguration_ITC_MASK 0x8000
#define DMACDMACCDMACConfiguration_ITC 0x8000
#define DMACDMACCDMACConfiguration_ITC_BIT 15
#define DMACDMACCDMACConfiguration_L_MASK 0x10000
#define DMACDMACCDMACConfiguration_L 0x10000
#define DMACDMACCDMACConfiguration_L_BIT 16
#define DMACDMACCDMACConfiguration_A_MASK 0x20000
#define DMACDMACCDMACConfiguration_A 0x20000
#define DMACDMACCDMACConfiguration_A_BIT 17
#define DMACDMACCDMACConfiguration_H_MASK 0x40000
#define DMACDMACCDMACConfiguration_H 0x40000
#define DMACDMACCDMACConfiguration_H_BIT 18

#define DMACDMACCControl_TransferSize_MASK 0xFFF
#define DMACDMACCControl_TransferSize_BIT 0
#define DMACDMACCControl_Prot_MASK 0x70000000
#define DMACDMACCControl_Prot_BIT 28

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const HAL_GPDMA *iHAL;
    // Control word for DMA channel
    TUInt32 iControl;

    // DMACConfiguration word for DMA channel
    TUInt32 iDMACConfiguration;

    // source address
    TUInt32 iSource;

    // destination address
    TUInt32 iDestination;

    // address of linked list
    TUInt32 iLinkedList;

    // gpdma iChannel
    TUInt8 iChannel;

    T_gpdmaPeripheral iSourcePeripheral;
    T_gpdmaPeripheral iDestinationPeripheral;

    // ISR hook function
    T_gpdmaCallback iISRCallback;
    void *iISRCallbackWorkspace;
} T_LPC1768_GPDMA_Workspace;

/*---------------------------------------------------------------------------*
 * Forward declaration:
 *---------------------------------------------------------------------------*/
static void LPC1768_GPDMA_Enable(void *aWorkspace);
/*static void LPC1768_GPDMA_Disable(void *aWorkspace);*/
static TBool LPC1768_GPDMA_ChannelIsEnabled(void *aWorkspace);
static void IGPDMAProcessInterrupt(T_LPC1768_GPDMA_Workspace *p);
IRQ_ROUTINE( IGPDMA)
;

/*---------------------------------------------------------------------------*
 * Static global variables:
 *---------------------------------------------------------------------------*/
// Number of G_opened dma channels.
static TUInt8 G_opened = 0;
static GPDMACH_TypeDef * const G_channelRegs[8] = {
        GPDMACH0,
        GPDMACH1,
        GPDMACH2,
        GPDMACH3,
        GPDMACH4,
        GPDMACH5,
        GPDMACH6,
        GPDMACH7, };

static T_LPC1768_GPDMA_Workspace * G_workspaceGPDMAChannel[8];

T_uezError LPC1768_GPDMA_InitializeWorkspace_ChannelX(
        void *aWorkspace,
        TUInt8 aChannel)
{
    T_LPC1768_GPDMA_Workspace *p = (T_LPC1768_GPDMA_Workspace *)aWorkspace;

    // Setup GPDMA peripheral
    LPC1768_GPDMA_Enable(aWorkspace);

    // channel X
    p->iChannel = aChannel;

    // Fill the structure with default value for control and attributes.
    p->iControl = 0;
    p->iISRCallback = 0;
    p->iLinkedList = 0;
    p->iSource = 0;
    p->iDestination = 0;

    // Make local reference to the created workspace. Used in interrupt handler.
    G_workspaceGPDMAChannel[aChannel] = aWorkspace;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPDMA_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1768 GPDMA iChannel workspaces.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPDMA_InitializeWorkspace_Channel0(void *aWorkspace)
{
    return LPC1768_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
            GPDMA_CHANNEL0);
}
T_uezError LPC1768_GPDMA_InitializeWorkspace_Channel1(void *aWorkspace)
{
    return LPC1768_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
            GPDMA_CHANNEL1);
}
T_uezError LPC1768_GPDMA_InitializeWorkspace_Channel2(void *aWorkspace)
{
    return LPC1768_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
            GPDMA_CHANNEL2);
}
T_uezError LPC1768_GPDMA_InitializeWorkspace_Channel3(void *aWorkspace)
{
    return LPC1768_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
            GPDMA_CHANNEL3);
}
T_uezError LPC1768_GPDMA_InitializeWorkspace_Channel4(void *aWorkspace)
{
    return LPC1768_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
            GPDMA_CHANNEL4);
}
T_uezError LPC1768_GPDMA_InitializeWorkspace_Channel5(void *aWorkspace)
{
    return LPC1768_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
            GPDMA_CHANNEL5);
}
T_uezError LPC1768_GPDMA_InitializeWorkspace_Channel6(void *aWorkspace)
{
    return LPC1768_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
            GPDMA_CHANNEL6);
}
T_uezError LPC1768_GPDMA_InitializeWorkspace_Channel7(void *aWorkspace)
{
    return LPC1768_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
            GPDMA_CHANNEL7);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPDMA_Stop
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable GPDMA iChannel. Data is lost if is in DMA FIFO.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPDMA_Stop(void *aWorkspace)
{

