FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_GPDMA.c
    T_LPC1768_GPDMA_Workspace *p = (T_LPC1768_GPDMA_Workspace *)aWorkspace;

    // Zero out the enable bit
    G_channelRegs[p->iChannel]->DMACCConfig &= ~(1 << 0);

#if 0 // currently not supported
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP0_TX)
    SSP0DMACR &= ~SSP0DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP0_RX)
    SSP0DMACR &= ~SSP0DMACR_RXDMAE_MASK;
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP1_TX)
    SSP1DMACR &= ~SSP1DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP1_RX)
    SSP1DMACR &= ~SSP1DMACR_RXDMAE_MASK;
#endif
    // Fill the structure with default value for iControl and attributes.
    p->iControl = 0;

    return UEZ_ERROR_NONE;

}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPDMA_ChannelIsEnabled
 *---------------------------------------------------------------------------*
 * Description:
 *      Check if GPDMA iChannel is enabled -> transfer in progress.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      TBool                   -- Enabled ETrue else EFalse
 *---------------------------------------------------------------------------*/
static TBool LPC1768_GPDMA_ChannelIsEnabled(void *aWorkspace)
{
    T_LPC1768_GPDMA_Workspace *p = (T_LPC1768_GPDMA_Workspace *)aWorkspace;

    // Enabled iChannel
    return (GPDMA->DMACEnbldChns & (1 << p->iChannel)) ? ETrue : EFalse;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPDMA_Start
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable GPDMA iChannel -> begin new transfer.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPDMA_Start(void *aWorkspace)
{
//    TUInt32 regValue = 0;
    T_LPC1768_GPDMA_Workspace *p = (T_LPC1768_GPDMA_Workspace *)aWorkspace;
    GPDMACH_TypeDef *p_channel;

    // Test if we can enable the iChannel.
    if (p->iControl == 0 || ETrue == LPC1768_GPDMA_ChannelIsEnabled(aWorkspace))
        return UEZ_ERROR_NOT_READY;

    //Clear any pending interrupts on the iChannel
    GPDMA->DMACIntTCClear = 1 << p->iChannel;
    GPDMA->DMACIntErrClr = 1 << p->iChannel;

    // Memory to memory transfer;
//    regValue |= ((0x0 & DMACDMACCDMACConfiguration_FlowCntrl_MASK)
//            << DMACDMACCDMACConfiguration_FlowCntrl_BIT) | DMACDMACCDMACConfiguration_E;

    // If the callback is set, process interrupts.
//    if (NULL != p->iISRCallback)
//        regValue |= DMACDMACCDMACConfiguration_IE | DMACDMACCDMACConfiguration_ITC;

    p_channel = G_channelRegs[p->iChannel];
    p_channel->DMACCSrcAddr = p->iSource;
    p_channel->DMACCDestAddr = p->iDestination;

    // linked list?
    p_channel->DMACCLLI = p->iLinkedList;

    // Write the iControl information into the DMACCxControl Register
    p_channel->DMACCControl = p->iControl;

    // Enable iChannel.
    p_channel->DMACCConfig = p->iDMACConfiguration;

#if 0 // Not currently supported
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP0_TX)
    SSP0DMACR |= SSP0DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP0_RX)
    SSP0DMACR |= SSP0DMACR_RXDMAE_MASK;
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP1_TX)
    SSP1DMACR |= SSP1DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP1_RX)
    SSP1DMACR |= SSP1DMACR_RXDMAE_MASK;
#endif

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPDMA_Enable
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable GPDMA controller and register interrupt handler.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
static void LPC1768_GPDMA_Enable(void *aWorkspace)
{
    (void)aWorkspace;

    // Increase number of G_opened channels.
    G_opened++;

    // Enable peripheral power (PCGPDMA)
    LPC1768PowerOn(1 << 29);

    // Was registered already?
    if (EFalse == InterruptIsRegistered(INTERRUPT_CHANNEL_GP_DMA)) {
        // Enable interrupt.
        InterruptRegister(INTERRUPT_CHANNEL_GP_DMA, (TISRFPtr)IGPDMA,
                INTERRUPT_PRIORITY_NORMAL, "GPDMA");
        InterruptEnable(INTERRUPT_CHANNEL_GP_DMA);
    }

    // Enable GPDMA by writing ENABLE bit.
    // Always little-endian.
    GPDMA->DMACConfig = DMACDMACCDMACConfiguration_E;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPDMA_PrepareRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Set up GPDMA iChannel.
 * Inputs:
 *      void *aW                       -- Particular GPDMA workspace
 *      const T_gpdmaRequest *aRequest -- Request to prepare
 *      T_gpdmaCallback aISRCallback   -- Routine to call when complete, or 0
 *                                       for none.
 *      void *aISRCallbackWorksspace   -- Pointer to data passed to callback
 *                                         routine.
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPDMA_PrepareRequest(
        void *aWorkspace,
        const T_gpdmaRequest *aRequest,
        T_gpdmaCallback aISRCallback,
        void *aISRCallbackWorkspace)
{
    TUInt32 control;
    TUInt32 flow;

    T_LPC1768_GPDMA_Workspace *p = (T_LPC1768_GPDMA_Workspace *)aWorkspace;

    // Load the destination & source address into the iControl block.
    // (Note: These only apply to memory transfers)
    p->iSource = (TUInt32)aRequest->iSourceAddr;
    p->iDestination = (TUInt32)aRequest->iDestinationAddr;

    // Load the iControl word.
    control = aRequest->iControl;

    // Channel 0 and 1 have the same defines, so only iChannel 0 is used.

    // Set the transfer size and mode in the iControl word.
    control |= (aRequest->iNumTransferItems << DMACDMACCControl_TransferSize_BIT)
            & DMACDMACCControl_TransferSize_MASK;

