FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_GPDMA.c
    // DMA Scatter-Gather?
    p->iLinkedList = (TUInt32)aRequest->iLinkedList;

    // Callback for DMA end or error?
    p->iISRCallback = aISRCallback;
    p->iISRCallbackWorkspace = aISRCallbackWorkspace;
    if (aISRCallback)
        control |= GPDMA_INT_ENABLE;

    // Bufferable and Cacheable. 0b110.
    control |= (0x6 << DMACDMACCControl_Prot_BIT) & DMACDMACCControl_Prot_MASK;

    // Store iControl value.
    p->iControl = control;

    // Flow control is to be determined by the various types
    // General output to match Table 675 from UM102347: LPC1768 user's manual
    flow = 0;
    p->iSourcePeripheral = aRequest->iSourcePeripheral;
    p->iDestinationPeripheral = aRequest->iDestinationPeripheral;

    if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_SOURCE_IS_PERIPHERAL;
    if (aRequest->iDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_DESTINATION_IS_PERIPHERAL;

    if (aRequest->iFlowControl == GPDMA_FLOW_CONTROL_DMA) {
        flow |= GPDMA_FLOW_CONTROL_DMA_CONTROLLER;
    } else if (aRequest->iFlowControl == GPDMA_FLOW_CONTROL_SOURCE_PERIPHERAL) {
        flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    } else if (aRequest->iFlowControl
            == GPDMA_FLOW_CONTROL_DESTINATION_PERIPHERAL) {
        if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
            flow = GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
        else
            flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    }

    // Setup flow control
    p->iDMACConfiguration = ((flow << DMACDMACCDMACConfiguration_FlowCntrl_BIT)
            & DMACDMACCDMACConfiguration_FlowCntrl_MASK) | DMACDMACCDMACConfiguration_E;

    // If the callback is set, process interrupts.
    if (aISRCallback)
        p->iDMACConfiguration |= DMACDMACCDMACConfiguration_IE | DMACDMACCDMACConfiguration_ITC;

    // If the source is a peripheral, DMACConfigure the type
    if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY) {
        p->iDMACConfiguration |= ((aRequest->iSourcePeripheral
                << DMACDMACCDMACConfiguration_SrcPeripheral_BIT)
                & DMACDMACCDMACConfiguration_SrcPeripheral_MASK);
    }

    // If the destination is a peripheral, DMACConfigure the type
    if (aRequest->iDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY) {
        p->iDMACConfiguration |= ((aRequest->iDestinationPeripheral
                << DMACDMACCDMACConfiguration_DestPeripheral_BIT)
                & DMACDMACCDMACConfiguration_DestPeripheral_MASK);
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPDMA_IsValidAddress
 *---------------------------------------------------------------------------*
 * Description:
 *      Determine if the GPDMA is valid
 * Inputs:
 *      TUInt32 aAddr               -- Address to check if GPDMA works here
 * Outputs:
 *      TBool                       -- ETrue if valid, else EFalse
 *---------------------------------------------------------------------------*/
static TBool LPC1768_GPDMA_IsValidAddress(TUInt32 aAddr)
{
    // On the LPC1768, all addresses are valid
    return ETrue;
}

/*---------------------------------------------------------------------------*
 * Routine:  IGPDMAProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the dma channels (as passed
 *      into the routine.
 *      NOTE:  This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_LPC1768_GPDMA_Workspace *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void IGPDMAProcessInterrupt(T_LPC1768_GPDMA_Workspace *p)
{
    T_gpdmaState state = GPDMA_UNKNOWN;

    // Check error state. Higher priority.
    if (GPDMA->DMACIntErrStat & (1 << p->iChannel)) {
        state = GPDMA_FAIL;
    } else if (GPDMA->DMACIntTCStat & (1 << p->iChannel)) {
        // Completed.
        state = GPDMA_SUCCESS;
    }

    // Call the callback function.
    if (NULL != p->iISRCallback)
        p->iISRCallback(p->iISRCallbackWorkspace, state);

    // Clear possible interrupt sources.
    GPDMA->DMACIntTCClear = (1 << p->iChannel);
    GPDMA->DMACIntErrClr = (1 << p->iChannel);
}

/*---------------------------------------------------------------------------*
 * Routine:  IGPDMA
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the GPDMA interrupt and forward to IGPDMAProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(IGPDMA)
{
    IRQ_START();
    // Determine interrupt source.
    if (GPDMA->DMACIntStat & (1 << GPDMA_CHANNEL0)) {
        //iChannel 0 - Enable callback
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[0]);
    }
    if (GPDMA->DMACIntStat & (1 << GPDMA_CHANNEL1)) {
        //iChannel 1
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[1]);
    }
    if (GPDMA->DMACIntStat & (1 << GPDMA_CHANNEL2)) {
        //iChannel 2
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[2]);
    }
    if (GPDMA->DMACIntStat & (1 << GPDMA_CHANNEL3)) {
        //iChannel 3
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[3]);
    }
    if (GPDMA->DMACIntStat & (1 << GPDMA_CHANNEL4)) {
        //iChannel 4
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[4]);
    }
    if (GPDMA->DMACIntStat & (1 << GPDMA_CHANNEL5)) {
        //iChannel 5
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[5]);
    }
    if (GPDMA->DMACIntStat & (1 << GPDMA_CHANNEL6)) {
        //iChannel 6
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[6]);
    }
    if (GPDMA->DMACIntStat & (1 << GPDMA_CHANNEL7)) {
        //iChannel 7
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[7]);
    }
    IRQ_END()
    ;
}

