FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_GPDMA.c
const HAL_GPDMA LPC1768_GPDMA_Channel0_Interface = {
        {
                "GPDMA:LPC1768:CH0",
                0x0100,
                LPC1768_GPDMA_InitializeWorkspace_Channel0,
                sizeof(T_LPC1768_GPDMA_Workspace), },
        LPC1768_GPDMA_PrepareRequest,
        LPC1768_GPDMA_Start,
        LPC1768_GPDMA_Stop,
        LPC1768_GPDMA_IsValidAddress, };

const HAL_GPDMA LPC1768_GPDMA_Channel1_Interface = {
        {
                "GPDMA:LPC1768:CH1",
                0x0100,
                LPC1768_GPDMA_InitializeWorkspace_Channel1,
                sizeof(T_LPC1768_GPDMA_Workspace), },
        LPC1768_GPDMA_PrepareRequest,
        LPC1768_GPDMA_Start,
        LPC1768_GPDMA_Stop,
        LPC1768_GPDMA_IsValidAddress, };

const HAL_GPDMA LPC1768_GPDMA_Channel2_Interface = {
        {
                "GPDMA:LPC1768:CH2",
                0x0100,
                LPC1768_GPDMA_InitializeWorkspace_Channel2,
                sizeof(T_LPC1768_GPDMA_Workspace), },
        LPC1768_GPDMA_PrepareRequest,
        LPC1768_GPDMA_Start,
        LPC1768_GPDMA_Stop,
        LPC1768_GPDMA_IsValidAddress, };

const HAL_GPDMA LPC1768_GPDMA_Channel3_Interface = {
        {
                "GPDMA:LPC1768:CH3",
                0x0100,
                LPC1768_GPDMA_InitializeWorkspace_Channel3,
                sizeof(T_LPC1768_GPDMA_Workspace), },
        LPC1768_GPDMA_PrepareRequest,
        LPC1768_GPDMA_Start,
        LPC1768_GPDMA_Stop,
        LPC1768_GPDMA_IsValidAddress, };

const HAL_GPDMA LPC1768_GPDMA_Channel4_Interface = {
        {
                "GPDMA:LPC1768:CH4",
                0x0100,
                LPC1768_GPDMA_InitializeWorkspace_Channel4,
                sizeof(T_LPC1768_GPDMA_Workspace), },
        LPC1768_GPDMA_PrepareRequest,
        LPC1768_GPDMA_Start,
        LPC1768_GPDMA_Stop,
        LPC1768_GPDMA_IsValidAddress, };

const HAL_GPDMA LPC1768_GPDMA_Channel5_Interface = {
        {
                "GPDMA:LPC1768:CH5",
                0x0100,
                LPC1768_GPDMA_InitializeWorkspace_Channel5,
                sizeof(T_LPC1768_GPDMA_Workspace), },
        LPC1768_GPDMA_PrepareRequest,
        LPC1768_GPDMA_Start,
        LPC1768_GPDMA_Stop,
        LPC1768_GPDMA_IsValidAddress, };

const HAL_GPDMA LPC1768_GPDMA_Channel6_Interface = {
        {
                "GPDMA:LPC1768:CH6",
                0x0100,
                LPC1768_GPDMA_InitializeWorkspace_Channel6,
                sizeof(T_LPC1768_GPDMA_Workspace), },
        LPC1768_GPDMA_PrepareRequest,
        LPC1768_GPDMA_Start,
        LPC1768_GPDMA_Stop,
        LPC1768_GPDMA_IsValidAddress, };

const HAL_GPDMA LPC1768_GPDMA_Channel7_Interface = {
        {
                "GPDMA:LPC1768:CH7",
                0x0100,
                LPC1768_GPDMA_InitializeWorkspace_Channel7,
                sizeof(T_LPC1768_GPDMA_Workspace), },
        LPC1768_GPDMA_PrepareRequest,
        LPC1768_GPDMA_Start,
        LPC1768_GPDMA_Stop,
        LPC1768_GPDMA_IsValidAddress, };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1768_GPDMA0_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA0",
            (T_halInterface *)&LPC1768_GPDMA_Channel0_Interface, 0, 0);
}

void LPC1768_GPDMA1_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA1",
            (T_halInterface *)&LPC1768_GPDMA_Channel1_Interface, 0, 0);
}

void LPC1768_GPDMA2_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA2",
            (T_halInterface *)&LPC1768_GPDMA_Channel2_Interface, 0, 0);
}

void LPC1768_GPDMA3_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA3",
            (T_halInterface *)&LPC1768_GPDMA_Channel3_Interface, 0, 0);
}

void LPC1768_GPDMA4_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA4",
            (T_halInterface *)&LPC1768_GPDMA_Channel4_Interface, 0, 0);
}

void LPC1768_GPDMA5_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA5",
            (T_halInterface *)&LPC1768_GPDMA_Channel5_Interface, 0, 0);
}

void LPC1768_GPDMA6_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA6",
            (T_halInterface *)&LPC1768_GPDMA_Channel6_Interface, 0, 0);
}

void LPC1768_GPDMA7_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA7",
            (T_halInterface *)&LPC1768_GPDMA_Channel7_Interface, 0, 0);
}

/*-------------------------------------------------------------------------*
 * End of File:  GPDMA.c
 *-------------------------------------------------------------------------*/
